# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
baby_names.drop(columns = ["Unnamed: 0","Id"], inplace = True)
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [68]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [73]:
names = baby_names.groupby(['Name'])
names.first()

         Year Gender State  Count
Name
Aaban    2013      M    NY      6
Aadan    2008      M    CA      7
Aadarsh  2009      M    IL      5
Aaden    2007      M    AL      5
Aadhav   2014      M    CA      6
...       ...    ...   ...    ...
Zyra     2012      F    CA      6
Zyrah    2011      F    CA      5
Zyren    2013      M    TX      6
Zyria    2007      F    GA      6
Zyriah   2007      F    GA      5

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [79]:
len(baby_names.Name.unique())

17632

### Step 9. What is the name with most occurrences?

In [109]:
baby_names.groupby("Name").Count.sum().sort_values(ascending = False).reset_index()

             Name   Count
0           Jacob  242874
1            Emma  214852
2         Michael  214405
3           Ethan  209277
4        Isabella  204798
...           ...     ...
17627      Eniola       5
17628    Atlantis       5
17629       Marci       5
17630  Simarpreet       5
17631        Nita       5

[17632 rows x 2 columns]

### Step 10. How many different names have the least occurrences?

In [100]:
len(baby_names.Name.unique())

17632

### Step 11. What is the median name occurrence?

In [110]:
len(baby_names.groupby("Name").Count.sum().median() == baby_names.groupby("Name").Count.sum().sort_values(ascending = False).reset_index().Count)

17632

### Step 12. What is the standard deviation of names?

In [111]:
baby_names.groupby("Name").Count.sum().std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [112]:
baby_names.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03